back-punny/app/controllers/api/v1/auth_controller.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."username" = $1 LIMIT $2  [["username", "hisyl"], ["LIMIT", 1]]
---
  def create
    account = Account.find_by(username: params[:username])