back-punny/app/controllers/api/v1/gifs_controller.rb

SELECT "gifs".* FROM "gifs"
---
  def index
    gifs = Gif.all

INSERT INTO "gifs" ("url", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["url", "https://media2.giphy.com/media/7Y66VN3rtkPtu/giphy.gif"], ["created_at", "2017-06-10 18:52:58.314310"], ["updated_at", "2017-06-10 18:52:58.314310"]]
---
  def create
    gif = Gif.create(gif_params)