back-punny/app/controllers/api/v1/puns_controller.rb

  def index
    if params[:date]
      puns = Pun.todays_puns
      date = Date.parse(params[:date])
      puns = Pun.puns_by_day(date)
      render json: puns
    else
      puns = Pun.all
---
SELECT "puns".* FROM "puns"

  def create
    gif = Gif.create(url: params[:gif][:url])
    pun = Pun.new(pun_params)
    pun.gif_id = gif.id
    user = User.find_by(first_name: params[:user][:first_name])
    pun.user_id = user.id
    # pun.user = current_account

    pun.save
---
INSERT INTO "gifs" ("url", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["url", "http://media0.giphy.com/media/Snil1KvtjhnIQ/giphy.gif"], ["created_at", "2017-06-10 18:18:50.405675"], ["updated_at", "2017-06-10 18:18:50.405675"]]
INSERT INTO "puns" ("pun", "user_id", "gif_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["pun", "hey you!"], ["user_id", 1], ["gif_id", 1], ["created_at", "2017-06-07 18:17:33.581884"], ["updated_at", "2017-06-07 18:17:33.581884"]]
INSERT INTO "users" ("created_at", "updated_at", "first_name") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2017-06-12 00:47:34.595250"], ["updated_at", "2017-06-12 00:47:34.595250"], ["first_name", "sylvee"]]